app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`title`, `body`, `author`, `edition_id`, `image`) VALUES('', '', '', NULL, NULL)

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 3)
UPDATE `articles` SET `body` = 'ver needed custom formatted sample / test data, like, bad? Well, that\'s the idea of the Data Generator. It\'s a free, open source script written in JavaScript, PHP and MySQL that lets you quickly generate large volumes of custom data in a variety of formats for use in testing software, populating databases, and scoring with girls.\r\n\r\nThis site offers an online demo where you\'re welcome to tinker around to get a sense of what the script does, what features it offers and how it works. Then, once you\'ve whet your appetite, there\'s a free, fully functional, GNU-licensed version available for download. Alternatively, if you want to avoid the hassle of setting	it up on your own server, you might want to consider donating $20 or more to help support the project. Any donation over $20 will get you a user account on this site, letting you generate up to 5,000 records at a time through the generator (instead of the maximum 200), and let you save your data settings for up to a year. Click on the Donate tab for more information.' WHERE `id` = 2