app/controllers/editions_controller.rb

SELECT * FROM `articles` WHERE (edition_id IS NULL)
---
  def new
    if Article.all.empty?

SELECT * FROM `editions` WHERE (`editions`.`id` = 2)
---
  def edit
    @edition = Edition.find params[:id]

SELECT * FROM `editions` WHERE (`editions`.`id` = 1)
---
  def show
    @edition = Edition.find params[:id]

SELECT * FROM `articles` WHERE (`articles`.edition_id = NULL)
INSERT INTO `editions` (`newsletter_id`, `published_on`) VALUES(1, NULL)
---
  def create
    @edition = Edition.new
    @edition.newsletter = @newsletter
    if params and params[:articles]
      @articles = Article.find(:all, :conditions=> ["id in (?)", params[:articles] ])
      @edition.articles = @articles
    end
    respond_to do |format|
       if @edition.save

SELECT * FROM `editions` WHERE (`editions`.`id` = 7)
DELETE FROM `editions` WHERE `id` = 7
---
  def destroy
    @edition = Edition.find params[:id]
    @edition.destroy

SELECT * FROM `articles` WHERE (`articles`.`id` = '2') LIMIT 1
SELECT * FROM `editions` WHERE (`editions`.`id` = 1)
UPDATE `articles` SET `edition_id` = 1 WHERE `id` = 2
---
  def add_article
    article = Article.find_by_id params[:article_id]
    edition = Edition.find params[:id]
    if edition and article
      article.edition_id = edition.id
      article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = '2') LIMIT 1
SELECT * FROM `editions` WHERE (`editions`.`id` = 1)
UPDATE `articles` SET `edition_id` = NULL WHERE `id` = 2
---
  def remove_article
    article = Article.find_by_id params[:article_id]
    edition = Edition.find params[:id]
    if edition and article
      article.edition_id = nil
      article.save