app/controllers/home_controller.rb

  def index
    @newsletters = Newsletter.find :all
    @articles = Article.find :all
---
SELECT * FROM `newsletters`
SELECT * FROM `articles`