app/controllers/newsletters_controller.rb

SELECT * FROM `newsletters` WHERE (`newsletters`.`id` = 1)
---
  def show
    @newsletter = Newsletter.find(params[:id])

INSERT INTO `newsletters` (`created_at`, `title`, `updated_at`) VALUES('2010-04-26 15:41:29', 'magazine', '2010-04-26 15:41:29')
---
  def create
    @newsletter = Newsletter.new(params[:newsletter])

    respond_to do |format|
      if @newsletter.save